pages/exam/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Exam | Programming for Economists</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://janboone.github.io/programming_for_economists/pages/pages/exam/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Jan Boone and Misja Mikkers">
<meta property="og:site_name" content="Programming for Economists">
<meta property="og:title" content="Exam">
<meta property="og:url" content="https://janboone.github.io/programming_for_economists/pages/pages/exam/">
<meta property="og:description" content="Grade


Your grade is either determined by:



the midterm exam which is python only (50%)

the exam will be R only (50%)



or by



the resit which is based on both python and R (100%)



Each exam ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-11-26T17:44:50+01:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://janboone.github.io/programming_for_economists/pages/">

            <span id="blog-title">Programming for Economists</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../" class="nav-link">Webpage</a>
                </li>
<li class="nav-item">
<a href="../schedule" class="nav-link">Schedule</a>
                </li>
<li class="nav-item">
<a href="../exam" class="nav-link">Exam</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Exam</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org020dd28" class="outline-2">
<h2 id="org020dd28">Grade</h2>
<div class="outline-text-2" id="text-org020dd28">
<p>
Your grade is <i>either</i> determined by:
</p>

<ul class="org-ul">
<li>the midterm exam which is python only (50%)</li>

<li>the exam will be R only (50%)</li>
</ul>
<p>
<i>or</i> by
</p>

<ul class="org-ul">
<li>the resit which is based on both python and R (100%)</li>
</ul>
<p>
Each exam lasts 3 hours. You <b>cannot</b> combine the resit with the midterm etc.
</p>
</div>
</div>


<div id="outline-container-org38e03f5" class="outline-2">
<h2 id="org38e03f5">Useful to know</h2>
<div class="outline-text-2" id="text-org38e03f5">
<p>
The questions that we ask in the exam are based on the notebooks that we discuss in class. Hence make sure that you have these ready before the exam. You are allowed to use copy-paste out of these notebooks.
</p>

<p>
During the semester, you can use google to find information on functions, error messages etc. However, during the exam you can only access a limited number of pages.
</p>

<p>
In particular, during the exam you work in a special exam environment on TiU computers. We have asked IT to whitelist the following websites:
</p>

<ul class="org-ul">
<li>the russet server (where you will do your exam)</li>
<li>github (to visit the course pages and ask questions during the exam at the <a href="https://github.com/janboone/programming_for_economists/issues">issues page</a>
</li>
<li>gitlab.uvt.nl (where you will import your exam from)</li>
<li>Blackboard (where we will give you the command to import the exam)</li>
<li><a href="https://stackoverflow.com/">https://stackoverflow.com/</a></li>
<li><a href="https://www.python.org/">https://www.python.org/</a></li>
<li><a href="http://www.numpy.org/">http://www.numpy.org/</a></li>
<li><a href="https://www.scipy.org/">https://www.scipy.org/</a></li>
<li><a href="https://pandas.pydata.org/">https://pandas.pydata.org/</a></li>
<li><a href="https://www.datacamp.com/home">https://www.datacamp.com/home</a></li>
<li><a href="http://www.cookbook-r.com/">http://www.cookbook-r.com/</a></li>
<li><a href="https://dplyr.tidyverse.org/">https://dplyr.tidyverse.org/</a></li>
<li><a href="https://rpubs.com/">https://rpubs.com/</a></li>
<li><a href="https://www.rstudio.com/">https://www.rstudio.com/</a></li>
<li><a href="https://r4ds.had.co.nz/">https://r4ds.had.co.nz/</a></li>
<li><a href="https://www.rdocumentation.org/">https://www.rdocumentation.org/</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf95b09b" class="outline-2">
<h2 id="orgf95b09b">Exam procedure</h2>
<div class="outline-text-2" id="text-orgf95b09b">
<ul class="org-ul">
<li>we will post the exam both on github and on Blackboard</li>
<li>At the start of the exam, go to Blackboard and copy paste the code into a jupyter notebook that will clone the exam repository</li>
<li>alternatively, download the exam files from Blackboard on your computer and then upload them on the server</li>
</ul>
</div>

<div id="outline-container-orgc00552e" class="outline-3">
<h3 id="orgc00552e">finishing your exam</h3>
<div class="outline-text-3" id="text-orgc00552e">
<ul class="org-ul">
<li>make sure that we can easily see which notebook is your exam
<ul class="org-ul">
<li>that is, do not rename the exam notebook (so that we do not know which notebook it is)</li>
<li>do not have 5 different versions of the exam notebook; we will then choose one at random and grade this one</li>
</ul>
</li>
<li>after you finish the exam, <b><b>do not re-open the notebook again</b></b>: we can see the last time the notebook was opened. If this is after you left the exam room, we can see this and will nullify your exam.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org0d8ff76" class="outline-2">
<h2 id="org0d8ff76">Practice exam</h2>
<div class="outline-text-2" id="text-org0d8ff76">
<p>
If you want to practice, you can use a <a href="../../exam_june_2018.html">previous year python exam</a> together with a discussion of the solution. Note that in previous years we used different notebooks in class. Hence, the solutions in the video's may look (slightly) different from the notebooks you have used yourself.
</p>

<p>
Make sure that you make the exam yourself first. You do not learn to program by looking at the solutions.
</p>
</div>
</div>
    </div>
    

</article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:j.boone@uvt.nl">Jan Boone and Misja Mikkers</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
